read_verilog -sv -formal -overwrite {workspace}/sources_1/new/bram_wr_ctrl.v
design -reset-vlog; proc;
write_json {workspace}/netlist/bram_wr_ctrl.json